trade_exp/src/Documents/СторноПоАннулированнымЛистам/СторноПоАннулированнымЛистам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7ca7cf10-0cc4-4cf4-84c6-612941e02e8f">
  <name>СторноПоАннулированнымЛистам</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="8f5b3b66-eb3a-430b-a0cf-23b12e290f62">
    <name>ПериодНачисления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="40fb35ea-e4ba-4119-b1d6-3b1c1a368bb8">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e23f7e90-3a9c-41ee-a008-e96fdfbabd6f">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="47c5a54d-c150-4849-8e70-375419c407ea">
    <name>Начисления</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="43cd3a44-4e73-4526-b4f3-f4e1cc231858">
      <name>Сотрудник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c540cfeb-934e-42e3-ae36-dfddb8b579bb">
      <name>Удержание</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="68221aab-86b5-4a9a-8a53-6342ad1b13f2">
      <name>Сторно</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b73dcae7-2745-4b88-a714-8cbe27dfd4d1">
      <name>РегистраторУдержания</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/AccumulationRegisters/НачисленияУдержаний/НачисленияУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="cb276f85-23f2-4f34-b5ad-8ff4958f4b48">
  <name>НачисленияУдержаний</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <registerType>Turnovers</registerType>
  <resources extendedConfigurationObject="a8a6f686-64bf-486f-878a-3a2d11d1ea5a">
    <name>СуммаЗадержки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="7fcb5e70-0a78-4965-ac0e-da25b7f35f36">
    <name>СуммаУдержания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="9eb43b5e-6086-4599-a2ee-f1b93f27250d">
    <name>СуммаВозврата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fc07c14a-9677-45ed-a7f3-c48d32cfeeee">
    <name>СуммаСторно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="92b35696-bc4b-4e39-baf2-792c4df395c3">
    <name>ПериодНачисления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="1a2b70d4-deac-4462-b1b6-dd336507cf52">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="2be42aa7-4d0f-4215-8085-021885108398">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7bfc9cfa-618d-41a7-a85f-18574af79ef9">
    <name>Удержание</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6e85eda3-b516-437b-96b7-6bdaadc191cf">
    <name>РегистраторУдержания</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/Documents/СторноПоАннулированнымЛистам/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		Если Не ЗначениеЗаполнено(Объект.Автор) Тогда 
		Объект.Автор= Пользователи.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачисленияПриИзменении(Элемент)
		Объект.ПериодНачисления= НачалоМесяца(Объект.ПериодНачисления);
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
		Если Объект.Проведен Тогда
		Предупреждение("перед перезаполнением необходимо распровести документ!", 5);
		Возврат;
	КонецЕсли;
	
	Если Объект.Начисления.Количество() > 0 Тогда
		ОтветНаВопрос = Вопрос(НСтр("ru='Таблица ""Начисления"" будет перезаполнена. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
		Если ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьНаСервере();
	ЭтаФорма.Модифицированность= Истина;
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьНаСервере()
	ПериодНачисления= КонецМесяца(Объект.ПериодНачисления);
	Объект.Начисления.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛистСогласования.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ АннулированныеЛисты
		|ИЗ
		|	Документ.ЛистСогласования КАК ЛистСогласования
		|ГДЕ
		|	ЛистСогласования.Проведен
		|	И ЛистСогласования.Аннулирован
		|	И ЛистСогласования.ДатаРегистрацииАннулирования МЕЖДУ &Дата1 И &Дата2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(НачисленияШтрафовОбороты.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
		|	НачисленияШтрафовОбороты.Сотрудник КАК Сотрудник,
		|	СУММА(НачисленияШтрафовОбороты.СуммаЗадержкиОборот) КАК СуммаЗадержки,
		|	СУММА(НачисленияШтрафовОбороты.СуммаУдержанияОборот) КАК СуммаУдержания,
		|	СУММА(НачисленияШтрафовОбороты.СуммаВозвратаОборот) КАК СуммаВозврата,
		|	СУММА(НачисленияШтрафовОбороты.СуммаСторноОборот) КАК СуммаСторно,
		|	НачисленияШтрафовОбороты.Удержание КАК Удержание,
		|	НачисленияШтрафовОбороты.РегистраторУдержания КАК РегистраторУдержания
		|ИЗ
		|	РегистрНакопления.НачисленияУдержаний.Обороты(, , Регистратор, ) КАК НачисленияШтрафовОбороты
		|ГДЕ
		|	НачисленияШтрафовОбороты.РегистраторУдержания В
		|			(ВЫБРАТЬ
		|				АннулированныеЛисты.Ссылка КАК Ссылка
		|			ИЗ
		|				АннулированныеЛисты КАК АннулированныеЛисты)
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияШтрафовОбороты.Сотрудник,
		|	НАЧАЛОПЕРИОДА(НачисленияШтрафовОбороты.ПериодНачисления, МЕСЯЦ),
		|	НачисленияШтрафовОбороты.Удержание,
		|	НачисленияШтрафовОбороты.РегистраторУдержания";
	
	Запрос.УстановитьПараметр("Дата1", НачалоМесяца(Объект.ПериодНачисления));
	Запрос.УстановитьПараметр("Дата2", КонецМесяца(Объект.ПериодНачисления));
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока= Объект.Начисления.Добавить();
		НоваяСтрока.Сотрудник= Выборка.Сотрудник;
		НоваяСтрока.Удержание= Выборка.Удержание;
		НоваяСтрока.РегистраторУдержания= Выборка.РегистраторУдержания;
		НоваяСтрока.Сторно= Выборка.СуммаЗадержки;
	КонецЦикла;
КонецПроцедуры
